{
  "architectures": [
    "Sam3Model"
  ],
  "detr_decoder_config": {
    "add_cross_attention": false,
    "bos_token_id": null,
    "box_rpb_mode": "log",
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dropout": 0.1,
    "dtype": "float32",
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_act": "relu",
    "hidden_dropout": 0.0,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "is_decoder": false,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_detr_decoder",
    "num_attention_heads": 8,
    "num_layers": 6,
    "num_queries": 200,
    "pad_token_id": null,
    "prefix": null,
    "sep_token_id": null,
    "task_specific_params": null,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "use_presence_token": true
  },
  "detr_encoder_config": {
    "add_cross_attention": false,
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dropout": 0.1,
    "dtype": "float32",
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_act": "relu",
    "hidden_dropout": 0.0,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "is_decoder": false,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_detr_encoder",
    "num_attention_heads": 8,
    "num_layers": 6,
    "pad_token_id": null,
    "prefix": null,
    "sep_token_id": null,
    "task_specific_params": null,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null
  },
  "dtype": "float32",
  "geometry_encoder_config": {
    "add_cross_attention": false,
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dropout": 0.1,
    "dtype": "float32",
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_act": "relu",
    "hidden_dropout": 0.0,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "is_decoder": false,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_geometry_encoder",
    "num_attention_heads": 8,
    "num_layers": 3,
    "pad_token_id": null,
    "prefix": null,
    "roi_size": 7,
    "sep_token_id": null,
    "task_specific_params": null,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null
  },
  "initializer_range": 0.02,
  "mask_decoder_config": {
    "add_cross_attention": false,
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dropout": 0.0,
    "dtype": "float32",
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "is_decoder": false,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_mask_decoder",
    "num_attention_heads": 8,
    "num_upsampling_stages": 3,
    "pad_token_id": null,
    "prefix": null,
    "sep_token_id": null,
    "task_specific_params": null,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null
  },
  "model_type": "sam3",
  "text_config": {
    "add_cross_attention": false,
    "attention_dropout": 0.0,
    "bos_token_id": 49406,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dtype": "float32",
    "eos_token_id": 49407,
    "finetuning_task": null,
    "hidden_act": "gelu",
    "hidden_size": 1024,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "is_decoder": false,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 32,
    "model_type": "clip_text_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 1,
    "prefix": null,
    "projection_dim": 512,
    "sep_token_id": null,
    "task_specific_params": null,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "vocab_size": 49408
  },
  "transformers_version": "5.0.0",
  "vision_config": {
    "add_cross_attention": false,
    "backbone_config": {
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "attention_dropout": 0.0,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "dtype": null,
      "eos_token_id": null,
      "finetuning_task": null,
      "global_attn_indexes": [
        7,
        15,
        23,
        31
      ],
      "hidden_act": "gelu",
      "hidden_dropout": 0.0,
      "hidden_size": 1024,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "image_size": 1008,
      "initializer_range": 0.02,
      "intermediate_size": 4736,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "layer_norm_eps": 1e-06,
      "layer_scale_init_value": null,
      "model_type": "sam3_vit_model",
      "num_attention_heads": 16,
      "num_channels": 3,
      "num_hidden_layers": 32,
      "output_attentions": false,
      "output_hidden_states": false,
      "pad_token_id": null,
      "patch_size": 14,
      "prefix": null,
      "pretrain_image_size": 336,
      "problem_type": null,
      "qkv_bias": true,
      "return_dict": true,
      "rope_theta": 10000.0,
      "sep_token_id": null,
      "task_specific_params": null,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "window_size": 24
    },
    "backbone_feature_sizes": [
      [
        288,
        288
      ],
      [
        144,
        144
      ],
      [
        72,
        72
      ]
    ],
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dtype": "float32",
    "eos_token_id": null,
    "finetuning_task": null,
    "fpn_hidden_size": 256,
    "fpn_kernel_size": 2,
    "fpn_stride": 2,
    "hidden_act": "gelu",
    "initializer_range": 0.02,
    "is_decoder": false,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_vision_model",
    "num_feature_levels": 3,
    "pad_token_id": null,
    "prefix": null,
    "scale_factors": [
      4.0,
      2.0,
      1.0,
      0.5
    ],
    "sep_token_id": null,
    "task_specific_params": null,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null
  }
}
