{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "<|startoftext|>",
  "clean_up_tokenization_spaces": false,
  "do_lower_case": true,
  "eos_token": "<|endoftext|>",
  "errors": "replace",
  "is_local": false,
  "max_length": 32,
  "model_max_length": 32,
  "model_specific_special_tokens": {},
  "pad_token": "<|endoftext|>",
  "processor_class": "Sam3Processor",
  "tokenizer_class": "CLIPTokenizer",
  "unk_token": "<|endoftext|>"
}
